[Killed] BooleanLiteral
src/augment.ts:24:9
   replacer: (raw: string) => string[]
 ): TokenAugmenter {
   return async (tokens) => {
-    if (!guard(tokens)) return [];
+    if (guard(tokens)) return [];
     const raw = tokens.map((t) => t.surface_form).join(' ');
     const variants = replacer(raw);
killedBy: augment watashi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
+   '。(。)',
    'あたし(アタシ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
+   'い(イ)|ます(マス)|。(。)',
+   'で(デ)|い(イ)|ます(マス)|。(。)',

[Killed] ConditionalExpression
src/augment.ts:24:9
   replacer: (raw: string) => string[]
 ): TokenAugmenter {
   return async (tokens) => {
-    if (!guard(tokens)) return [];
+    if (false) return [];
     const raw = tokens.map((t) => t.surface_form).join(' ');
     const variants = replacer(raw);
killedBy: augment watashi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
+   '。(。)',
    'あたし(アタシ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
+   'い(イ)|ます(マス)|。(。)',
+   'で(デ)|い(イ)|ます(マス)|。(。)',

[Killed] ArrowFunction
src/augment.ts:25:28
 ): TokenAugmenter {
   return async (tokens) => {
     if (!guard(tokens)) return [];
-    const raw = tokens.map((t) => t.surface_form).join(' ');
+    const raw = tokens.map(() => undefined).join(' ');
     const variants = replacer(raw);
     const out: IpadicFeatures[][] = [];
killedBy: augment watashi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
    'あたし(アタシ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
    '俺(オレ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
    '僕(ボク)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',

[Killed] BlockStatement
src/augment.ts:28:34
     const raw = tokens.map((t) => t.surface_form).join(' ');
     const variants = replacer(raw);
     const out: IpadicFeatures[][] = [];
-    for (const text of variants) {
-      const toks = await tokenize(text);
-      out.push(toks); // filter out empty tokens
-    }
+    for (const text of variants) {}
     return out;
   };
killedBy: augment watashi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
    'あたし(アタシ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
    '俺(オレ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
    '僕(ボク)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',

[Killed] EqualityOperator
src/augment.ts:39:45
 async function augmentDesuDaTokens(
   tokens: IpadicFeatures[]
 ): Promise<IpadicFeatures[][]> {
-  const desuIndex = tokens.findIndex((t) => t.surface_form === 'です');
+  const desuIndex = tokens.findIndex((t) => t.surface_form !== 'です');
 
   if (
killedBy: augment watashi alone
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
    'あたし(アタシ)',
+   'だ(ダ)',
    '俺(オレ)',
    '僕(ボク)',

[Killed] ConditionalExpression
src/augment.ts:39:45
 async function augmentDesuDaTokens(
   tokens: IpadicFeatures[]
 ): Promise<IpadicFeatures[][]> {
-  const desuIndex = tokens.findIndex((t) => t.surface_form === 'です');
+  const desuIndex = tokens.findIndex((t) => false);
 
   if (
killedBy: augment desu -> da
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
-   '彼(カレ)|の(ノ)|犬(イヌ)|は(ハ)|静か(シズカ)|だ(ダ)',
    '彼(カレ)|の(ノ)|犬(イヌ)|は(ハ)|静か(シズカ)|です(デス)'
  ]

[Killed] LogicalOperator
src/augment.ts:42:5
   const desuIndex = tokens.findIndex((t) => t.surface_form === 'です');
 
   if (
-    desuIndex !== tokens.length - 1 &&
-    (desuIndex !== tokens.length - 2 ||
-      (tokens[tokens.length - 1].pos !== '記号' &&
-        tokens[tokens.length - 1].pos !== '名詞'))
+    desuIndex !== tokens.length - 1 || desuIndex !== tokens.length - 2 || tokens[tokens.length - 1].pos !== '記号' && tokens[tokens.length - 1].pos !== '名詞'
   ) {
     return Promise.resolve([]);
killedBy: augment desu -> da
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
-   '彼(カレ)|の(ノ)|犬(イヌ)|は(ハ)|静か(シズカ)|だ(ダ)',
    '彼(カレ)|の(ノ)|犬(イヌ)|は(ハ)|静か(シズカ)|です(デス)'
  ]

[Killed] EqualityOperator
src/augment.ts:42:5
   const desuIndex = tokens.findIndex((t) => t.surface_form === 'です');
 
   if (
-    desuIndex !== tokens.length - 1 &&
+    desuIndex === tokens.length - 1 &&
     (desuIndex !== tokens.length - 2 ||
       (tokens[tokens.length - 1].pos !== '記号' &&
killedBy: augment anata -> kimi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
+   'あなた(アナタ)|は(ハ)|誰(ダレ)|だ(ダ)|か(カ)|？(？)',
    'あなた(アナタ)|は(ハ)|誰(ダレ)|です(デス)|か(カ)|？(？)',
+   '君(キミ)|は(ハ)|誰(ダレ)|だ(ダ)|か(カ)|？(？)',
    '君(キミ)|は(ハ)|誰(ダレ)|です(デス)|か(カ)|？(？)'

[Killed] LogicalOperator
src/augment.ts:43:6
 
   if (
     desuIndex !== tokens.length - 1 &&
-    (desuIndex !== tokens.length - 2 ||
-      (tokens[tokens.length - 1].pos !== '記号' &&
-        tokens[tokens.length - 1].pos !== '名詞'))
+    (desuIndex !== tokens.length - 2 && tokens[tokens.length - 1].pos !== '記号' && tokens[tokens.length - 1].pos !== '名詞')
   ) {
     return Promise.resolve([]);
killedBy: augment anata -> kimi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
+   'あなた(アナタ)|は(ハ)|誰(ダレ)|だ(ダ)|か(カ)|？(？)',
    'あなた(アナタ)|は(ハ)|誰(ダレ)|です(デス)|か(カ)|？(？)',
+   '君(キミ)|は(ハ)|誰(ダレ)|だ(ダ)|か(カ)|？(？)',
    '君(キミ)|は(ハ)|誰(ダレ)|です(デス)|か(カ)|？(？)'

[Killed] ConditionalExpression
src/augment.ts:43:6
 
   if (
     desuIndex !== tokens.length - 1 &&
-    (desuIndex !== tokens.length - 2 ||
-      (tokens[tokens.length - 1].pos !== '記号' &&
-        tokens[tokens.length - 1].pos !== '名詞'))
+    (true)
   ) {
     return Promise.resolve([]);
killedBy: augment desu。 -> da。
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
-   '彼(カレ)|の(ノ)|犬(イヌ)|は(ハ)|静か(シズカ)|だ(ダ)|。(。)',
    '彼(カレ)|の(ノ)|犬(イヌ)|は(ハ)|静か(シズカ)|です(デス)|。(。)'
  ]

[Killed] LogicalOperator
src/augment.ts:44:8
   if (
     desuIndex !== tokens.length - 1 &&
     (desuIndex !== tokens.length - 2 ||
-      (tokens[tokens.length - 1].pos !== '記号' &&
-        tokens[tokens.length - 1].pos !== '名詞'))
+      (tokens[tokens.length - 1].pos !== '記号' || tokens[tokens.length - 1].pos !== '名詞'))
   ) {
     return Promise.resolve([]);
killedBy: augment desu。 -> da。
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
-   '彼(カレ)|の(ノ)|犬(イヌ)|は(ハ)|静か(シズカ)|だ(ダ)|。(。)',
    '彼(カレ)|の(ノ)|犬(イヌ)|は(ハ)|静か(シズカ)|です(デス)|。(。)'
  ]

[Killed] ConditionalExpression
src/augment.ts:44:8
   if (
     desuIndex !== tokens.length - 1 &&
     (desuIndex !== tokens.length - 2 ||
-      (tokens[tokens.length - 1].pos !== '記号' &&
-        tokens[tokens.length - 1].pos !== '名詞'))
+      (false))
   ) {
     return Promise.resolve([]);
killedBy: augment kimi -> anata
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
+   'あなた(アナタ)|は(ハ)|誰(ダレ)|だ(ダ)|か(カ)',
    'あなた(アナタ)|は(ハ)|誰(ダレ)|です(デス)|か(カ)',
+   '君(キミ)|は(ハ)|誰(ダレ)|だ(ダ)|か(カ)',
    '君(キミ)|は(ハ)|誰(ダレ)|です(デス)|か(カ)'

[Killed] ConditionalExpression
src/augment.ts:45:9
     desuIndex !== tokens.length - 1 &&
     (desuIndex !== tokens.length - 2 ||
       (tokens[tokens.length - 1].pos !== '記号' &&
-        tokens[tokens.length - 1].pos !== '名詞'))
+        true))
   ) {
     return Promise.resolve([]);
killedBy: augment desu. -> da.
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
-   '彼(カレ)|の(ノ)|犬(イヌ)|は(ハ)|静か(シズカ)|だ(ダ)|.(undefined)',
    '彼(カレ)|の(ノ)|犬(イヌ)|は(ハ)|静か(シズカ)|です(デス)|.(undefined)'
  ]

[Killed] ArithmeticOperator
src/augment.ts:45:16
     desuIndex !== tokens.length - 1 &&
     (desuIndex !== tokens.length - 2 ||
       (tokens[tokens.length - 1].pos !== '記号' &&
-        tokens[tokens.length - 1].pos !== '名詞'))
+        tokens[tokens.length + 1].pos !== '名詞'))
   ) {
     return Promise.resolve([]);
killedBy: augment watashi alone
statusReason: Cannot read properties of undefined (reading 'pos')

[Killed] BlockStatement
src/augment.ts:46:5
     (desuIndex !== tokens.length - 2 ||
       (tokens[tokens.length - 1].pos !== '記号' &&
         tokens[tokens.length - 1].pos !== '名詞'))
-  ) {
-    return Promise.resolve([]);
-  }
+  ) {}
   if (desuIndex > 0) {
     const prior = tokens[desuIndex - 1];
killedBy: augment anata -> kimi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
+   'あなた(アナタ)|は(ハ)|誰(ダレ)|だ(ダ)|か(カ)|？(？)',
    'あなた(アナタ)|は(ハ)|誰(ダレ)|です(デス)|か(カ)|？(？)',
+   '君(キミ)|は(ハ)|誰(ダレ)|だ(ダ)|か(カ)|？(？)',
    '君(キミ)|は(ハ)|誰(ダレ)|です(デス)|か(カ)|？(？)'

[Killed] EqualityOperator
src/augment.ts:49:7
   ) {
     return Promise.resolve([]);
   }
-  if (desuIndex > 0) {
+  if (desuIndex >= 0) {
     const prior = tokens[desuIndex - 1];
     if (prior.pos !== '名詞') {
killedBy: augment desu alone
statusReason: Cannot read properties of undefined (reading 'pos')

[Killed] ConditionalExpression
src/augment.ts:49:7
   ) {
     return Promise.resolve([]);
   }
-  if (desuIndex > 0) {
+  if (true) {
     const prior = tokens[desuIndex - 1];
     if (prior.pos !== '名詞') {
killedBy: augment watashi alone
statusReason: Cannot read properties of undefined (reading 'pos')

[Killed] ArithmeticOperator
src/augment.ts:50:26
     return Promise.resolve([]);
   }
   if (desuIndex > 0) {
-    const prior = tokens[desuIndex - 1];
+    const prior = tokens[desuIndex + 1];
     if (prior.pos !== '名詞') {
       return Promise.resolve([]);
killedBy: augment desu -> da
statusReason: Cannot read properties of undefined (reading 'pos')

[Killed] BlockStatement
src/augment.ts:51:29
   }
   if (desuIndex > 0) {
     const prior = tokens[desuIndex - 1];
-    if (prior.pos !== '名詞') {
-      return Promise.resolve([]);
-    }
+    if (prior.pos !== '名詞') {}
   }
 
killedBy: augment da after i-adjective is ungrammatical
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
+   '難しい(ムズカシイ)|だ(ダ)',
    '難しい(ムズカシイ)|です(デス)'
  ]

[Killed] ConditionalExpression
src/augment.ts:51:9
   }
   if (desuIndex > 0) {
     const prior = tokens[desuIndex - 1];
-    if (prior.pos !== '名詞') {
+    if (false) {
       return Promise.resolve([]);
     }
killedBy: augment da after i-adjective is ungrammatical
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
+   '難しい(ムズカシイ)|だ(ダ)',
    '難しい(ムズカシイ)|です(デス)'
  ]

[Killed] BlockStatement
src/augment.ts:57:20
   }
 
   const replacement = tokens
-    .map((t, i) => {
-      if (i === desuIndex) return 'だ';
-      return t.surface_form;
-    })
+    .map((t, i) => {})
     .join(' ');
   const replacementTokens = await tokenize(replacement);
killedBy: augment watashi alone
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
    'あたし(アタシ)',
    '俺(オレ)',
    '僕(ボク)',
    '私(ワタシ)',

[Killed] EqualityOperator
src/augment.ts:58:11
 
   const replacement = tokens
     .map((t, i) => {
-      if (i === desuIndex) return 'だ';
+      if (i !== desuIndex) return 'だ';
       return t.surface_form;
     })
killedBy: augment watashi alone
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
    'あたし(アタシ)',
+   'だ(ダ)',
    '俺(オレ)',
    '僕(ボク)',

[Killed] ConditionalExpression
src/augment.ts:58:11
 
   const replacement = tokens
     .map((t, i) => {
-      if (i === desuIndex) return 'だ';
+      if (false) return 'だ';
       return t.surface_form;
     })
killedBy: augment desu -> da
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
-   '彼(カレ)|の(ノ)|犬(イヌ)|は(ハ)|静か(シズカ)|だ(ダ)',
    '彼(カレ)|の(ノ)|犬(イヌ)|は(ハ)|静か(シズカ)|です(デス)'
  ]

[Killed] EqualityOperator
src/augment.ts:73:11
   async function replace(tokens: IpadicFeatures[]) {
     const result = [];
     for (const token of tokens) {
-      if (token.surface_form === search) {
+      if (token.surface_form !== search) {
         result.push(replacement);
       } else {
killedBy: augment watashi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
+   'あたし(アタシ)|あたし(アタシ)|あたし(アタシ)|あたし(アタシ)|あたし(アタシ)|あたし(アタシ)|あたし(アタシ)|あたし(アタシ)|あたし(アタシ)|あたし(アタシ)',
+   'あたし(アタシ)|あたし(アタシ)|あたし(アタシ)|あたし(アタシ)|あたし(アタシ)|あたし(アタシ)|あたし(アタシ)|あたし(アタシ)|あたし(アタシ)',
+   'あたし(アタシ)|あたし(アタシ)|あたし(アタシ)|あたし(アタシ)|あたし(アタシ)|あたし(アタシ)|あたし(アタシ)|あたし(アタシ)',
+   'あなた(アナタ)|あなた(アナタ)|あなた(アナタ)|あなた(アナタ)|あなた(アナタ)|あなた(アナタ)|あなた(アナタ)|

[Killed] ConditionalExpression
src/augment.ts:73:11
   async function replace(tokens: IpadicFeatures[]) {
     const result = [];
     for (const token of tokens) {
-      if (token.surface_form === search) {
+      if (false) {
         result.push(replacement);
       } else {
killedBy: augment watashi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
-   'あたし(アタシ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
    '今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '俺(オレ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '僕(ボク)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',

[Killed] BlockStatement
src/augment.ts:75:14
     for (const token of tokens) {
       if (token.surface_form === search) {
         result.push(replacement);
-      } else {
-        result.push(token.surface_form);
-      }
+      } else {}
     }
     return Promise.resolve([await tokenize(result.join(' '))]);
killedBy: augment watashi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
+   'あたし(アタシ)',
-   'あたし(アタシ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
    '今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
+   '俺(オレ)',

[Killed] EqualityOperator
src/augment.ts:86:36
 
 const augmentDropWatashiHa = makeTokenAugmenter(
   // Guard: first two tokens are 私 + は, and there’s at least one more token
-  (tokens) => tokens.length > 1 && tokens[0].surface_form === '私', // &&
+  (tokens) => tokens.length > 1 && tokens[0].surface_form !== '私', // &&
   // tokens[1].surface_form === 'は',
 
killedBy: augment watashi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
+   '。(。)',
    'あたし(アタシ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
+   'い(イ)|ます(マス)|。(。)',
+   'で(デ)|い(イ)|ます(マス)|。(。)',

[Killed] LogicalOperator
src/augment.ts:86:15
 
 const augmentDropWatashiHa = makeTokenAugmenter(
   // Guard: first two tokens are 私 + は, and there’s at least one more token
-  (tokens) => tokens.length > 1 && tokens[0].surface_form === '私', // &&
+  (tokens) => tokens.length > 1 || tokens[0].surface_form === '私', // &&
   // tokens[1].surface_form === 'は',
 
killedBy: augment watashi
statusReason: Cannot read properties of undefined (reading 'surface_form')

[Killed] MethodExpression
src/augment.ts:91:21
 
   // Replacer: lexically cut off the leading “私は”
   (raw) => {
-    const dropped = raw.slice('私 は '.length);
+    const dropped = raw;
     return [dropped];
   }
killedBy: augment watashi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
    'あたし(アタシ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
    '俺(オレ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
    '僕(ボク)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',

[Killed] ArrowFunction
src/augment.ts:101:41
   newReading: string
 ): TokenAugmenter {
   return async (tokens: IpadicFeatures[]): Promise<IpadicFeatures[][]> => {
-    const tokenIndex = tokens.findIndex((t) => t.surface_form === surfaceForm);
+    const tokenIndex = tokens.findIndex(() => undefined);
 
     if (tokenIndex === -1) {
killedBy: augment nippon to nihon
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
    '日本(ニッポン)|に(ニ)|行き(イキ)|たい(タイ)|。(。)',
-   '日本(ニホン)|に(ニ)|行き(イキ)|たい(タイ)|。(。)'
  ]

[Killed] ConditionalExpression
src/augment.ts:101:48
   newReading: string
 ): TokenAugmenter {
   return async (tokens: IpadicFeatures[]): Promise<IpadicFeatures[][]> => {
-    const tokenIndex = tokens.findIndex((t) => t.surface_form === surfaceForm);
+    const tokenIndex = tokens.findIndex((t) => false);
 
     if (tokenIndex === -1) {
killedBy: augment nippon to nihon
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
    '日本(ニッポン)|に(ニ)|行き(イキ)|たい(タイ)|。(。)',
-   '日本(ニホン)|に(ニ)|行き(イキ)|たい(タイ)|。(。)'
  ]

[Killed] ConditionalExpression
src/augment.ts:103:9
   return async (tokens: IpadicFeatures[]): Promise<IpadicFeatures[][]> => {
     const tokenIndex = tokens.findIndex((t) => t.surface_form === surfaceForm);
 
-    if (tokenIndex === -1) {
+    if (false) {
       return Promise.resolve([]);
     }
killedBy: augment watashi
statusReason: Cannot set properties of undefined (setting 'reading')

[Killed] EqualityOperator
src/augment.ts:103:9
   return async (tokens: IpadicFeatures[]): Promise<IpadicFeatures[][]> => {
     const tokenIndex = tokens.findIndex((t) => t.surface_form === surfaceForm);
 
-    if (tokenIndex === -1) {
+    if (tokenIndex !== -1) {
       return Promise.resolve([]);
     }
killedBy: augment watashi
statusReason: Cannot set properties of undefined (setting 'reading')

[Killed] ArrayDeclaration
src/augment.ts:109:28
 
     const newGroup = structuredClone(tokens);
     newGroup[tokenIndex].reading = newReading;
-    return Promise.resolve([newGroup]);
+    return Promise.resolve([]);
   };
 }
killedBy: augment nippon to nihon
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
    '日本(ニッポン)|に(ニ)|行き(イキ)|たい(タイ)|。(。)',
-   '日本(ニホン)|に(ニ)|行き(イキ)|たい(タイ)|。(。)'
  ]

[Killed] ArrayDeclaration
src/augment.ts:113:43
   };
 }
 
-const tokenAugmenters: TokenAugmenter[] = [
-  makeReplaceWholeToken('私', '僕'),
-  makeReplaceWholeToken('僕', '俺'),
-  makeReplaceWholeToken('あなた', '君'),
-  makeReplaceWholeToken('君', 'あなた'),
-  makeReplaceWholeToken('私', 'あたし'),
-  augmentDesuDaTokens,
-  augmentDropWatashiHa,
-  makeReadingModifierAugmenter('日本', 'ニホン'),
-];
+const tokenAugmenters: TokenAugmenter[] = [];
 
 export function toLexicalKey(tokens: IpadicFeatures[]): string {
killedBy: augment watashi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
-   'あたし(アタシ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '俺(オレ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '僕(ボク)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',

[Killed] StringLiteral
src/augment.ts:114:25
 }
 
 const tokenAugmenters: TokenAugmenter[] = [
-  makeReplaceWholeToken('私', '僕'),
+  makeReplaceWholeToken("", '僕'),
   makeReplaceWholeToken('僕', '俺'),
   makeReplaceWholeToken('あなた', '君'),
killedBy: augment watashi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
    'あたし(アタシ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
    '今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '俺(オレ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '僕(ボク)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',

[Killed] StringLiteral
src/augment.ts:115:30
 
 const tokenAugmenters: TokenAugmenter[] = [
   makeReplaceWholeToken('私', '僕'),
-  makeReplaceWholeToken('僕', '俺'),
+  makeReplaceWholeToken('僕', ""),
   makeReplaceWholeToken('あなた', '君'),
   makeReplaceWholeToken('君', 'あなた'),
killedBy: augment watashi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
    'あたし(アタシ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
+   'は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
    '今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '俺(オレ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',

[Killed] StringLiteral
src/augment.ts:115:25
 
 const tokenAugmenters: TokenAugmenter[] = [
   makeReplaceWholeToken('私', '僕'),
-  makeReplaceWholeToken('僕', '俺'),
+  makeReplaceWholeToken("", '俺'),
   makeReplaceWholeToken('あなた', '君'),
   makeReplaceWholeToken('君', 'あなた'),
killedBy: augment watashi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
    'あたし(アタシ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
    '今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '俺(オレ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
    '僕(ボク)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',

[Killed] StringLiteral
src/augment.ts:116:32
 const tokenAugmenters: TokenAugmenter[] = [
   makeReplaceWholeToken('私', '僕'),
   makeReplaceWholeToken('僕', '俺'),
-  makeReplaceWholeToken('あなた', '君'),
+  makeReplaceWholeToken('あなた', ""),
   makeReplaceWholeToken('君', 'あなた'),
   makeReplaceWholeToken('私', 'あたし'),
killedBy: augment anata -> kimi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
    'あなた(アナタ)|は(ハ)|誰(ダレ)|です(デス)|か(カ)|？(？)',
+   'は(ハ)|誰(ダレ)|です(デス)|か(カ)|？(？)'
-   '君(キミ)|は(ハ)|誰(ダレ)|です(デス)|か(カ)|？(？)'
  ]

[Killed] StringLiteral
src/augment.ts:116:25
 const tokenAugmenters: TokenAugmenter[] = [
   makeReplaceWholeToken('私', '僕'),
   makeReplaceWholeToken('僕', '俺'),
-  makeReplaceWholeToken('あなた', '君'),
+  makeReplaceWholeToken("", '君'),
   makeReplaceWholeToken('君', 'あなた'),
   makeReplaceWholeToken('私', 'あたし'),
killedBy: augment anata -> kimi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
    'あなた(アナタ)|は(ハ)|誰(ダレ)|です(デス)|か(カ)|？(？)',
-   '君(キミ)|は(ハ)|誰(ダレ)|です(デス)|か(カ)|？(？)'
  ]

[Killed] StringLiteral
src/augment.ts:118:30
   makeReplaceWholeToken('僕', '俺'),
   makeReplaceWholeToken('あなた', '君'),
   makeReplaceWholeToken('君', 'あなた'),
-  makeReplaceWholeToken('私', 'あたし'),
+  makeReplaceWholeToken('私', ""),
   augmentDesuDaTokens,
   augmentDropWatashiHa,
killedBy: augment watashi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
+   'は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   'あたし(アタシ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
    '今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
    '俺(オレ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',

[Killed] ArrowFunction
src/augment.ts:125:36
 ];
 
 export function toLexicalKey(tokens: IpadicFeatures[]): string {
-  return JSON.stringify(tokens.map((t) => `${t.surface_form}(${t.reading})`));
+  return JSON.stringify(tokens.map(() => undefined));
 }
 
killedBy: augment watashi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
+   '私(ワタシ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   'あたし(アタシ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
    '今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '俺(オレ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',

[Killed] BlockStatement
src/augment.ts:136:49
   // a queue of groups we still need to process
   const queue: IpadicFeatures[][] = [];
 
-  function addToQueue(tokens: IpadicFeatures[]) {
-    const noWhitespace = tokens.filter(
-      (it) => it.surface_form.trim().length !== 0
-    );
-    const key = toLexicalKey(noWhitespace);
-    if (!map.has(key)) {
-      map.set(key, noWhitespace);
-      queue.push(noWhitespace);
-    }
-  }
+  function addToQueue(tokens: IpadicFeatures[]) {}
 
   // seed with the originals
killedBy: augment watashi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

+ []
- [
-   'あたし(アタシ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '俺(オレ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',

[Timeout] MethodExpression
src/augment.ts:137:26
   const queue: IpadicFeatures[][] = [];
 
   function addToQueue(tokens: IpadicFeatures[]) {
-    const noWhitespace = tokens.filter(
-      (it) => it.surface_form.trim().length !== 0
-    );
+    const noWhitespace = tokens;
     const key = toLexicalKey(noWhitespace);
     if (!map.has(key)) {

[Killed] ArrowFunction
src/augment.ts:138:7
 
   function addToQueue(tokens: IpadicFeatures[]) {
     const noWhitespace = tokens.filter(
-      (it) => it.surface_form.trim().length !== 0
+      () => undefined
     );
     const key = toLexicalKey(noWhitespace);
killedBy: augment watashi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
+   ''
-   'あたし(アタシ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '俺(オレ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',

[Killed] EqualityOperator
src/augment.ts:138:15
 
   function addToQueue(tokens: IpadicFeatures[]) {
     const noWhitespace = tokens.filter(
-      (it) => it.surface_form.trim().length !== 0
+      (it) => it.surface_form.trim().length === 0
     );
     const key = toLexicalKey(noWhitespace);
killedBy: augment watashi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
+   '         (undefined)',
+   ' (undefined)| (undefined)| (undefined)| (undefined)| (undefined)'
-   'あたし(アタシ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',

[Killed] ConditionalExpression
src/augment.ts:141:9
       (it) => it.surface_form.trim().length !== 0
     );
     const key = toLexicalKey(noWhitespace);
-    if (!map.has(key)) {
+    if (false) {
       map.set(key, noWhitespace);
       queue.push(noWhitespace);
killedBy: augment watashi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

+ []
- [
-   'あたし(アタシ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '俺(オレ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',

[Killed] BlockStatement
src/augment.ts:141:24
       (it) => it.surface_form.trim().length !== 0
     );
     const key = toLexicalKey(noWhitespace);
-    if (!map.has(key)) {
-      map.set(key, noWhitespace);
-      queue.push(noWhitespace);
-    }
+    if (!map.has(key)) {}
   }
 
killedBy: augment watashi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

+ []
- [
-   'あたし(アタシ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '俺(オレ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',

[Killed] BlockStatement
src/augment.ts:148:36
   }
 
   // seed with the originals
-  for (const grp of initialGroups) {
-    addToQueue(grp);
-  }
+  for (const grp of initialGroups) {}
 
   // process until no new groups are produced
killedBy: augment watashi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

+ []
- [
-   'あたし(アタシ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '俺(オレ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',

[Killed] EqualityOperator
src/augment.ts:153:10
   }
 
   // process until no new groups are produced
-  while (queue.length > 0) {
+  while (queue.length >= 0) {
     const grp = queue.shift()!;
     for (const plugin of tokenAugmenters) {
killedBy: augment watashi
statusReason: tokens is not iterable

[Killed] EqualityOperator
src/augment.ts:153:10
   }
 
   // process until no new groups are produced
-  while (queue.length > 0) {
+  while (queue.length <= 0) {
     const grp = queue.shift()!;
     for (const plugin of tokenAugmenters) {
killedBy: augment watashi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
-   'あたし(アタシ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '俺(オレ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '僕(ボク)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',

[Killed] BlockStatement
src/augment.ts:155:43
   // process until no new groups are produced
   while (queue.length > 0) {
     const grp = queue.shift()!;
-    for (const plugin of tokenAugmenters) {
-      const results = await plugin(grp);
-      for (const newGrp of results) {
-        addToQueue(newGrp);
-      }
-    }
+    for (const plugin of tokenAugmenters) {}
   }
 
killedBy: augment watashi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
-   'あたし(アタシ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '俺(オレ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '僕(ボク)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',

[Killed] BlockStatement
src/augment.ts:157:37
     const grp = queue.shift()!;
     for (const plugin of tokenAugmenters) {
       const results = await plugin(grp);
-      for (const newGrp of results) {
-        addToQueue(newGrp);
-      }
+      for (const newGrp of results) {}
     }
   }
killedBy: augment watashi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
-   'あたし(アタシ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '俺(オレ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
-   '僕(ボク)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',

[Killed] MethodExpression
src/augment.ts:164:3
   }
 
   const result = Array.from(map.values());
-  result.sort((a, b) => toLexicalKey(a).localeCompare(toLexicalKey(b)));
+  result;
 
   return result;
killedBy: augment watashi
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
+   '私(ワタシ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
+   '僕(ボク)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
    'あたし(アタシ)|は(ハ)|今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
    '今(イマ)|本(ホン)|を(ヲ)|読ん(ヨン)|で(デ)|い(イ)|ます(マス)|。(。)',
